xmlsamples/PI_MTCN/KR-SMS-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-store-request>
         <device>
            <id>001</id>
            <type>RETAIL</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>ESP</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>divya</first_name>
               <last_name>panneer</last_name>
            </name>
            <address>
               <addr_line1>ASFJALSKJ</addr_line1>
               <city>SEOUL</city>
               <state>SEOUL</state>
               <postal_code>823749</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>KR</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
               </country_code>
            </address>
            <compliance_details>
               <template_id>INT_06_S</template_id>
               <id_details>
                  <id_type>A</id_type>
                  <id_country_of_issue>KOREA</id_country_of_issue>
                  <id_number>47256778907</id_number>
               </id_details>
               <id_expiration_date>30122026</id_expiration_date>
               <date_of_birth>01011978</date_of_birth>
               <Country_of_Birth>KOREA</Country_of_Birth>
               <Does_the_ID_have_an_expiration_date>Y</Does_the_ID_have_an_expiration_date>
               <ack_flag>X</ack_flag>
            </compliance_details>
            <contact_phone>431232454321</contact_phone>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
            <fraud_warning_consent>Y</fraud_warning_consent>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>ZHAOGUO</first_name>
               <last_name>ZOU</last_name>
            </name>
            <address>
               <addr_line1> TEST GUADALUPE 8513 ESPERANZA AGUSAN DEL SUR GUADALUPE ESPERANZA PHILIPPINES</addr_line1>
               <city>Sydney</city>
               <state>NSW</state>
               <postal_code>20671</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>CN</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
                  <country_name>CHINA</country_name>
               </country_code>
            </address>
            <contact_phone>09668811885</contact_phone>
         </receiver>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>KR</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>KR</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>BUSAN</originating_city>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <exchange_rate>1.0000000</exchange_rate>
            <fix_on_send>Y</fix_on_send>
            <duplicate_detection_flag>D</duplicate_detection_flag>
         </payment_details>
         <financials>
            <taxes>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <originators_principal_amount>400000</originators_principal_amount>
            <destination_principal_amount>400000</destination_principal_amount>
            <gross_total_amount>411200</gross_total_amount>
            <plus_charges_amount>0</plus_charges_amount>
            <charges>11200</charges>
            <message_charge>0</message_charge>
         </financials>
         <delivery_services>
            <code>000</code>
				<message>
					<message_details context="1">
						<text>Test additional message</text>
					</message_details>
				</message>
         </delivery_services>
         <mtcn>8869076385</mtcn>
         <new_mtcn>2004288869076385</new_mtcn>
         <foreign_remote_system>
            <identifier>WGHHKR5670P</identifier>
            <reference_no>232523543534643</reference_no>
            <counter_id>KR567ARP001A</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-store-request>
   </soapenv:Body>
</soapenv:Envelope>